package _8_graph

//图论
//1. 遍历 DFS / BFS
//2. AOV / AOE 网络
//3. Kruskal 算法(最小生成树)
//4. Prim 算法(最小生成树)
//5. Boruvka 算法(最小生成树)
//6. Dijkstra 算法(单源最短路径)
//7. Bellman-Ford 算法(单源最短路径)
//8. SPFA 算法(单源最短路径)
//9. Floyd 算法(多源最短路径)
//10. Johnson 算法(多源最短路径)
//11. Fleury 算法(欧拉回路)
//12. Ford-Fulkerson 算法(最大网络流增广路)
//13. Edmonds-Karp 算法(最大网络流)
//14. Dinic 算法(最大网络流)
//15. 一般预流推进算法
//16. 最高标号预流推进 HLPP 算法
//17. Primal-Dual 原始对偶算法(最小费用流)18. Kosaraju 算法(有向图强连通分量)
//19. Tarjan 算法(有向图强连通分量)
//20. Gabow 算法(有向图强连通分量)
//21. 匈牙利算法(二分图匹配)
//22. Hopcroft－Karp 算法(二分图匹配)
//23. kuhn munkras 算法(二分图最佳匹配)
//24. Edmonds’ Blossom-Contraction 算法(一般图匹配)

//1. 图遍历
//2. 有向图和无向图的强弱连通性
//3. 割点/割边
//3. AOV 网络和拓扑排序
//4. AOE 网络和关键路径
//5. 最小代价生成树/次小生成树
//6. 最短路径问题/第 K 短路问题
//7. 最大网络流问题
//8. 最小费用流问题
//9. 图着色问题
//10. 差分约束系统
//11. 欧拉回路
//12. 中国邮递员问题
//13. 汉密尔顿回路
//14. 最佳边割集/最佳点割集/最小边割集/最小点割集/最小路径覆盖/最小点集覆盖
//15. 边覆盖集
//16. 二分图完美匹配和最大匹配问题
//17. 仙人掌图
//18. 弦图
//19. 稳定婚姻问题
//20. 最大团问题
