package _1_NP_C

//NP 完全

//1. 计算模型
//2. P 类与 NP 类问题
//3. NP 完全问题
//4. NP 完全问题的近似算法

//1. 随机存取机 RAM
//2. 随机存取存储程序机 RASP
//3. 图灵机
//4. 非确定性图灵机
//5. P 类与 NP 类语言
//6. 多项式时间验证
//7. 多项式时间变换
//8. Cook定理
//9. 合取范式的可满足性问题 CNF-SAT
//10. 3 元合取范式的可满足性问题 3-SAT
//11. 团问题 CLIQUE
//12. 顶点覆盖问题 VERTEX-COVER
//13. 子集和问题 SUBSET-SUM
//14. 哈密顿回路问题 HAM-CYCLE
//15. 旅行售货员问题 TSP
//16. 顶点覆盖问题的近似算法
//17. 旅行售货员问题近似算法
//18. 具有三角不等式性质的旅行售货员问题
//19. 一般的旅行售货员问题
//20. 集合覆盖问题的近似算法
//21. 子集和问题的近似算法
//22. 子集和问题的指数时间算法
//23. 子集和问题的多项式时间近似格式
